In [1]:
import pandas as pd
import numpy as np

In [2]:
#merging 2 data frames

In [3]:
employees = pd.DataFrame({
    'emp_id':[1,2,3,4,5],
    'name':['John','Anna','Peter','Linda','Bob'],
    'department':['HR','IT','Finance','IT','HR']
}) 

#dataFrame2:salary info
salaries = pd.DataFrame({
    'emp_id':[1,2,3,6,7],
    'salary':[60000,80000,65000,70000,90000],
    'bonus':[5000,10000,7000,8000,17000]
})

In [4]:
employees

   emp_id   name department
0       1   John         HR
1       2   Anna         IT
2       3  Peter    Finance
3       4  Linda         IT
4       5    Bob         HR

In [5]:
salaries

   emp_id  salary  bonus
0       1   60000   5000
1       2   80000  10000
2       3   65000   7000
3       6   70000   8000
4       7   90000  17000

In [8]:
pd.merge(employees,salaries,on='emp_id',how='inner')

   emp_id   name department  salary  bonus
0       1   John         HR   60000   5000
1       2   Anna         IT   80000  10000
2       3  Peter    Finance   65000   7000

In [9]:
pd.merge(employees,salaries,on='emp_id',how='outer')

   emp_id   name department   salary    bonus
0       1   John         HR  60000.0   5000.0
1       2   Anna         IT  80000.0  10000.0
2       3  Peter    Finance  65000.0   7000.0
3       4  Linda         IT      NaN      NaN
4       5    Bob         HR      NaN      NaN
5       6    NaN        NaN  70000.0   8000.0
6       7    NaN        NaN  90000.0  17000.0

In [10]:
pd.merge(employees,salaries,on='emp_id',how='left')

   emp_id   name department   salary    bonus
0       1   John         HR  60000.0   5000.0
1       2   Anna         IT  80000.0  10000.0
2       3  Peter    Finance  65000.0   7000.0
3       4  Linda         IT      NaN      NaN
4       5    Bob         HR      NaN      NaN

In [11]:
pd.merge(employees,salaries,on='emp_id',how='right')

   emp_id   name department  salary  bonus
0       1   John         HR   60000   5000
1       2   Anna         IT   80000  10000
2       3  Peter    Finance   65000   7000
3       6    NaN        NaN   70000   8000
4       7    NaN        NaN   90000  17000

In [12]:
#concatination of 2 data

In [ ]:
#Join of 2 Data